import pytest

@pytest.fixture
def operations_list():
    return [{'Дата операции': '03.01.2018 14:55:21', 'Дата платежа': '03.01.2018', 'Номер карты': '*7197',
      'Статус': 'OK', 'Сумма операции': -21.0, 'Валюта операции': 'RUB',
      'Сумма платежа': -21.0, 'Валюта платежа': 'RUB', 'Кэшбэк': 'nan', 'Категория': 'Дом и ремонт',
      'MCC': 5977.0, 'Описание': 'OOO Balid', 'Бонусы (включая кэшбэк)': 0,
      'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 21.0},
     {'Дата операции': '05.01.2018 20:27:51', 'Дата платежа': '05.01.2018', 'Номер карты': '*7197',
      'Статус': 'OK', 'Сумма операции': -316.0, 'Валюта операции': 'RUB', 'Сумма платежа': -316.0,
      'Валюта платежа': 'RUB', 'Кэшбэк': 'nan', 'Категория': 'Еда', 'MCC': 5977.0,
      'Описание': 'OOO Balid', 'Бонусы (включая кэшбэк)': 6, 'Округление на инвесткопилку': 0,
      'Сумма операции с округлением': 316.0},
    {'Дата операции': '10.01.2018 12:43:34', 'Дата платежа': '10.01.2018', 'Номер карты': '*5441',
     'Статус': 'FAILED', 'Сумма операции': -30068.0, 'Валюта операции': 'RUB', 'Сумма платежа': -30068.0,
     'Валюта платежа': 'RUB', 'Кэшбэк': 'nan', 'Категория': 'nan', 'MCC': 'nan', 'Описание': 'Перевод с карты',
     'Бонусы (включая кэшбэк)': 0, 'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 30068.0},
    {'Дата операции': '10.01.2018 12:42:44', 'Дата платежа': '10.01.2018', 'Номер карты': '*5441',
     'Статус': 'FAILED', 'Сумма операции': -40068.0, 'Валюта операции': 'RUB', 'Сумма платежа': -40068.0,
     'Валюта платежа': 'RUB', 'Кэшбэк': 'nan', 'Категория': 'Супермаркеты', 'MCC': 'nan', 'Описание': 'Перевод с карты',
     'Бонусы (включая кэшбэк)': 0, 'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 40068.0},
     {'Дата операции': '01.02.2018 20:27:51', 'Дата платежа': '01.02.2018', 'Номер карты': '*7197',
      'Статус': 'OK', 'Сумма операции': -316.0, 'Валюта операции': 'RUB', 'Сумма платежа': -316.0,
      'Валюта платежа': 'RUB', 'Кэшбэк': 'nan', 'Категория': 'Переводы', 'MCC': 5977.0,
      'Описание': 'OOO Balid', 'Бонусы (включая кэшбэк)': 6, 'Округление на инвесткопилку': 0,
      'Сумма операции с округлением': 316.0}
     ]

@pytest.fixture
def list_search_date():
    return [{'Дата операции': '03.01.2018 14:55:21', 'Дата платежа': '03.01.2018',
             'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -21.0,
             'Валюта операции': 'RUB', 'Сумма платежа': -21.0, 'Валюта платежа': 'RUB',
             'Кэшбэк': 'nan', 'Категория': 'Дом и ремонт', 'MCC': 5977.0,
             'Описание': 'OOO Balid', 'Бонусы (включая кэшбэк)': 0,
             'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 21.0},
            {'Дата операции': '05.01.2018 20:27:51', 'Дата платежа': '05.01.2018',
             'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -316.0,
             'Валюта операции': 'RUB', 'Сумма платежа': -316.0, 'Валюта платежа': 'RUB',
             'Кэшбэк': 'nan', 'Категория': 'Еда', 'MCC': 5977.0, 'Описание': 'OOO Balid',
             'Бонусы (включая кэшбэк)': 6, 'Округление на инвесткопилку': 0,
             'Сумма операции с округлением': 316.0}]

@pytest.fixture
def test_result_card_user():
    return [{'last_digits': '7197', 'total_spent': 653.0, 'cashback': 6.53},
            {'last_digits': '5441', 'total_spent': 70136.0, 'cashback': 701.36}]

@pytest.fixture
def test_result_top_trans():
    return [
        {'date': '10.01.2018 12:42:44', 'amount': 40068.0, 'category': 'Супермаркеты',
         'description': 'Перевод с карты', 'v': 'RUB'},
        {'date': '10.01.2018 12:43:34', 'amount': 30068.0, 'category': 'nan',
         'description': 'Перевод с карты', 'v': 'RUB'},
        {'date': '05.01.2018 20:27:51', 'amount': 316.0, 'category': 'Еда',
         'description': 'OOO Balid', 'v': 'RUB'},
        {'date': '01.02.2018 20:27:51', 'amount': 316.0, 'category': 'Переводы',
         'description': 'OOO Balid', 'v': 'RUB'},
        {'date': '03.01.2018 14:55:21', 'amount': 21.0, 'category': 'Дом и ремонт',
         'description': 'OOO Balid', 'v': 'RUB'}]


@pytest.fixture
def test_result_cashback():
    return """{"Переводы":3.16}"""
